result/grid_search_results.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-15 Sun 22:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Grid Search Results</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Olav Landmark Pedersen" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Grid Search Results</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org662d214">1. Decision Tree</a></li>
<li><a href="#org26fb858">2. Logistic Regression</a></li>
<li><a href="#org62e714c">3. Neural Network</a>
<ul>
<li><a href="#orgd9e8916">3.1. For the original 10 input features</a></li>
<li><a href="#org52b090f">3.2. For the added 26 input features with 26-13-1 structure</a></li>
<li><a href="#org57fa95d">3.3. For the added 26 input features with 26-17-9-1 structure</a></li>
</ul>
</li>
<li><a href="#org53e2198">4. Links to Other Files in Project</a></li>
</ul>
</div>
</div>


<div id="outline-container-org662d214" class="outline-2">
<h2 id="org662d214"><span class="section-number-2">1</span> Decision Tree</h2>
<div class="outline-text-2" id="text-1">
<p>
The following results are from when only using the original 10 features.
The following pipeline also uses Principal Component Analysis (PCA) first
and finds the best number of components for the decision tree.
</p>

<p>
<b>PCA Components</b>:
</p>
<ul class="org-ul">
<li>Best number of components: From 1 to the max number of features (10).</li>
</ul>

<p>
<b>Decision Tree</b>:
</p>
<ul class="org-ul">
<li>Different Class Weights <code>class_weight=[{0: 1.0, 1: w} for w in [10, 12, 14, 15, 16, 17, 18]],</code></li>
<li>Criterion = <code>['gini', 'entropy']</code></li>
<li>Max Depth = <code>[2, 4, 6, 8, 10, 12]</code></li>
</ul>

<pre class="example" id="org720c8eb">
: Best Score: 0.5178250609559948
: Best Criterion: gini
: Best max_depth: 12
: Best Number Of Components: 6
:
: DecisionTreeClassifier(class_weight={0: 1.0, 1: 16}, max_depth=12)
</pre>
</div>
</div>

<div id="outline-container-org26fb858" class="outline-2">
<h2 id="org26fb858"><span class="section-number-2">2</span> Logistic Regression</h2>
<div class="outline-text-2" id="text-2">
<p>
The following results are from when only using the original 10 features.
</p>

<ul class="org-ul">
<li>Penalty = <code>['l1', 'l2']</code></li>
<li>C = <code>np.logspace(-4, 4, 20),</code></li>
<li>Different Class Weights <code>class_weight=[{0: 1.0, 1: w} for w in [10, 12, 14, 15, 16, 17, 18]],</code></li>
<li>Solver = <code>['liblinear']</code></li>
</ul>

<pre class="example" id="org69e4120">
Fitting 5 folds for each of 280 candidates, totalling 1400 fits
Best Score: 0.5373897826007131

Best Estimator: LogisticRegression(C=1.623776739188721, class_weight={0: 1.0, 1: 10},
                   penalty='l1', random_state=0, solver='liblinear')
</pre>
</div>
</div>

<div id="outline-container-org62e714c" class="outline-2">
<h2 id="org62e714c"><span class="section-number-2">3</span> Neural Network</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd9e8916" class="outline-3">
<h3 id="orgd9e8916"><span class="section-number-3">3.1</span> For the original 10 input features</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The following results are from when only using the original 10 features.
There were a few iterations since the optimal solutions were endpoints.
</p>

<p>
The dataset for this was not balanced! There were no class weights for the
following result
</p>
<ul class="org-ul">
<li>Batch Size = <code>[2, 4, 6, 8, 10]</code></li>
<li>Epochs = <code>[100, 125, 150, 175, 200]</code></li>
</ul>

<pre class="example" id="org5c5a146">
Best Score: 0.6292982089131982
Best Estimator: {'verbose': 0, 'batch_size': 4, 'epochs': 200, 'build_fn': &lt;function create_model at 0x7f440e43d9d0&gt;}
</pre>

<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[3, 4, 5]</code></li>
<li>Epochs = <code>[190, 200, 210]</code></li>
</ul>

<pre class="example" id="org1cfa6a0">
Best Score: 0.589460143563261

Best Estimator: {'verbose': 0, 'batch_size': 5, 'epochs': 210, 'build_fn': &lt;function create_model at 0x7f938bf6a9d0&gt;}
</pre>

<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[4, 6, 10, 20]</code></li>
<li>Epochs = <code>[200, 250, 300, 400]</code></li>
</ul>

<pre class="example" id="org83dcd6b">
Best Score: 0.5824397099036812
Best Estimator: {'verbose': 0, 'batch_size': 6, 'epochs': 250, 'build_fn': &lt;function create_model at 0x7f938bf5a280&gt;}
</pre>
</div>
</div>

<div id="outline-container-org52b090f" class="outline-3">
<h3 id="org52b090f"><span class="section-number-3">3.2</span> For the added 26 input features with 26-13-1 structure</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[5, 6, 7]</code></li>
<li>Epochs = <code>[230, 235, 240, 245, 250]</code></li>
</ul>

<pre class="example" id="orgc1daeb8">
Best Score: 0.6141709069236523

Best Estimator: {'verbose': 0, 'batch_size': 6, 'epochs': 240, 'build_fn': &lt;function create_model at 0x7fe6b47933a0&gt;}
</pre>
</div>
</div>

<div id="outline-container-org57fa95d" class="outline-3">
<h3 id="org57fa95d"><span class="section-number-3">3.3</span> For the added 26 input features with 26-17-9-1 structure</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[2, 4, 6, 8, 10]</code></li>
<li>Epochs = <code>[100, 125, 150, 175, 200]</code></li>
</ul>

<pre class="example" id="org9f5e07b">
Best Score: 0.6292286798742979

Best Estimator: {'verbose': 0, 'batch_size': 2, 'epochs': 100, 'build_fn': &lt;function create_model at 0x7fe6b4648670&gt;}
</pre>

<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[1, 2, 4]</code></li>
<li>Epochs = <code>[25, 50, 75, 100, 125]</code></li>
</ul>

<pre class="example" id="org265dfc2">
Best Score: 0.5979329942840022

Best Estimator: {'verbose': 0, 'batch_size': 1, 'epochs': 125, 'build_fn': &lt;function create_model at 0x7fe634937040&gt;}
</pre>

<p>
The <code>class weights</code> parameter were set to 'balanced' for this run.
</p>
<ul class="org-ul">
<li>Batch Size = <code>[1, 2, 4]</code></li>
<li>Epochs = <code>[125, 150, 200, 250, 300]</code></li>
</ul>

<pre class="example" id="org8eef706">
Best Score: 0.6079706322981303

Best Estimator: {'verbose': 0, 'batch_size': 4, 'epochs': 125, 'build_fn': &lt;function create_model at 0x7fe6b47933a0&gt;}
</pre>

<p>
It turns out that for this structure, it seems to be peaking at around 0.60 -
0.63 with:
</p>

<ul class="org-ul">
<li>Batch Size: 4</li>
<li>Epochs: 125</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org53e2198" class="outline-2">
<h2 id="org53e2198"><span class="section-number-2">4</span> Links to Other Files in Project</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://www.olavpedersen.com/standalone_hof/extract_data.html">extract_data</a>: Extracting data from Lahman's raw data.</li>
<li><a href="https://www.olavpedersen.com/standalone_hof/filter_data.html">filter_data</a>: Data manipulation, feature creation and feature selection.</li>
<li><a href="https://www.olavpedersen.com/standalone_hof/hall_of_fame_model.html">hof_model</a>: Creation of the model and training of the neural network.</li>
<li><a href="https://www.olavpedersen.com/standalone_hof/grid_search_results.html">grid_search_results</a>: Storing some of the results for the best Grid Searches</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Olav Landmark Pedersen</p>
<p class="date">Created: 2021-08-15 Sun 22:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
